<font color = 'gray', size = 6>
<b>
set up
</b>
</font>

get data files here: http://www.datacarpentry.org/python-ecology-lesson/setup/

store them in a folder called 'data' in the same place as you will open your jupyter notebook

<font color = 'orange', size = 4>
this lesson is about combining data from different sources
</font>

<font color = 'blue', size = 6>
<b>
Concatenating DataFrames
</b>
</font>

<font color = 'orange', size = 4>
I always start with both numpy and pandas
</font>

In [2]:
import numpy as np
import pandas as pd

<font color = 'orange', size = 4>
let's look at our surveys data
</font>

<font color = 'orange', size = 4>
this time we're going to give pandas more specific instructions for how to handle null values
</font>

In [3]:
surveys_df = pd.read_csv('data/surveys.csv', 
                         keep_default_na = False, 
                         na_values = [''])

surveys_df.head()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

<font color = 'orange', size = 4>
to more easily show how concatenating works, let's use small parts of our data
</font>

In [11]:
first5 = surveys_df.head()
last5 = surveys_df.tail()

In [8]:
first5

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

In [12]:
last5

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

<font color = 'orange', size = 4>
let's combine those two dataframes, first horizontally
</font>

In [16]:
horizontal_stack = pd.concat([first5, last5], axis = 1)
horizontal_stack

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1.0,7.0,16.0,1977.0,2.0,NL,M,32.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,7.0,16.0,1977.0,3.0,NL,M,33.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,7.0,16.0,1977.0,2.0,DM,F,37.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,7.0,16.0,1977.0,7.0,DM,M,36.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,7.0,16.0,1977.0,3.0,DM,M,35.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35544,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35545.0,12.0,31.0,2002.0,15.0,AH,NaN,NaN,NaN
35545,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35546.0,12.0,31.0,2002.0,15.0,AH,NaN,NaN,NaN
35546,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35547.0,12.0,31.0,2002.0,10.0,RM,F,15.0,14.0
35547,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35548.0,12.0,31.0,2002.0,7.0,DO,M,36.0,51.0
35548,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35549.0,12.0,31.0,2002.0,5.0,NaN,NaN,NaN,NaN

<font color = 'orange', size = 4>
now vertically
</font>

In [15]:
vertical_stack = pd.concat([first5, last5], axis = 0)
vertical_stack

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

<font color = 'orange', size = 4>
even though our vertical_stack is its own object, it kept the original index numbers
</font>

<font color = 'orange', size = 4>
let's reset that index
</font>

In [18]:
new_vertical_stack = vertical_stack.reset_index()
new_vertical_stack

,index,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,0,1,7,16,1977,2,NL,M,32.0,NaN
1,1,2,7,16,1977,3,NL,M,33.0,NaN
2,2,3,7,16,1977,2,DM,F,37.0,NaN
3,3,4,7,16,1977,7,DM,M,36.0,NaN
4,4,5,7,16,1977,3,DM,M,35.0,NaN
5,35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
6,35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
7,35546,35547,12,31,2002,10,RM,F,15.0,14.0
8,35547,35548,12,31,2002,7,DO,M,36.0,51.0
9,35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

<font color = 'orange', size = 4>
let's reset the index and get rid of the old one
</font>

In [19]:
new_vertical_stack = vertical_stack.reset_index(drop = True)
new_vertical_stack

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN
5,35545,12,31,2002,15,AH,NaN,NaN,NaN
6,35546,12,31,2002,15,AH,NaN,NaN,NaN
7,35547,12,31,2002,10,RM,F,15.0,14.0
8,35548,12,31,2002,7,DO,M,36.0,51.0
9,35549,12,31,2002,5,NaN,NaN,NaN,NaN

<font color = 'blue', size = 6>
<b>
Joining Two DataFrames
</b>
</font>

<font color = 'orange', size = 4>
often you will have different types of data in different files
</font>

<font color = 'orange', size = 4>
to bring these together into one file or dataframe, we do a join
</font>

<font color = 'orange', size = 4>
we'll discuss different types of joins later
</font>

<font color = 'orange', size = 4>
to start, let's join our surveys data with some species data
</font>

<font color = 'orange', size = 4>
first, let's get our surveys data again
</font>

In [21]:
surveys_df = pd.read_csv('data/surveys.csv', 
                         keep_default_na = False, 
                         na_values = [''])

surveys_df.head()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

<font color = 'red', size = 4>
challenge :: make a new dataframe of just the first 10 rows, and call it 'surveys_sub'
</font>

In [27]:
surveys_sub = pd.DataFrame(surveys_df.head(10))
surveys_sub

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN
5,6,7,16,1977,1,PF,M,14.0,NaN
6,7,7,16,1977,2,PE,F,NaN,NaN
7,8,7,16,1977,1,DM,M,37.0,NaN
8,9,7,16,1977,1,DM,F,34.0,NaN
9,10,7,16,1977,6,PF,F,20.0,NaN

<font color = 'orange', size = 4>
now let's get a subset of species data
</font>

<font color = 'red', size = 4>
challenge :: make a new dataframe, called 'species_sub'
</font>

<font color = 'red', size = 4>
the data is in our data folder in a file called 'speciesSubset.csv'
</font>

<font color = 'red', size = 4>
use the same parameters as we used for the surveys_df above
</font>

In [28]:
species_sub = pd.read_csv('data/speciesSubset.csv', 
                         keep_default_na = False, 
                         na_values = [''])

species_sub

  species_id       genus   species    taxa
0         DM   Dipodomys  merriami  Rodent
1         NL     Neotoma  albigula  Rodent
2         PE  Peromyscus  eremicus  Rodent

<font color = 'blue', size = 6>
<b>
Identifying Join Keys
</b>
</font>

<font color = 'orange', size = 4>
you might have noticed that the two dataframes share a column name, with values that match
</font>

<font color = 'orange', size = 4>
this is called our 'join key', meaning the link between the two datasets
</font>

<font color = 'orange', size = 4>
you might need to rename columns, or do some data cleaning to make your joins keys match
</font>

<font color = 'orange', size = 4>
when you think of joins, think in terms of venn diagrams
</font>

<img src = 'images/venn_keys.png'>

<font color = 'orange', size = 4>
in our surveys & species data, the shared keys are any values in the species_id that match
</font>

<font color = 'blue', size = 6>
<b>
Inner Joins
</b>
</font>

<font color = 'orange', size = 4>
let's look at an example using an inner join, meaning the intersection
</font>

<img src = 'images/venn_inner.png'>

<font color = 'orange', size = 4>
first we want to check the sizes to be sure we know what data we're keeping
</font>

In [24]:
print('surveys =', surveys_sub.shape)
print('species =', species_sub.shape)

surveys = (10, 9)
species = (3, 4)

<font color = 'orange', size = 4>
now let's do the inner join to see what happens
</font>

In [45]:
merged_inner = pd.merge(left = surveys_sub, right = species_sub, 
                        left_on = 'species_id', right_on = 'species_id',
                        how = 'inner')
merged_inner.shape

(8, 12)

<font color = 'orange', size = 4>
what does it actually look like?
</font>

In [35]:
merged_inner

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,genus,species,taxa
0,1,7,16,1977,2,NL,M,32.0,NaN,Neotoma,albigula,Rodent
1,2,7,16,1977,3,NL,M,33.0,NaN,Neotoma,albigula,Rodent
2,3,7,16,1977,2,DM,F,37.0,NaN,Dipodomys,merriami,Rodent
3,4,7,16,1977,7,DM,M,36.0,NaN,Dipodomys,merriami,Rodent
4,5,7,16,1977,3,DM,M,35.0,NaN,Dipodomys,merriami,Rodent
5,8,7,16,1977,1,DM,M,37.0,NaN,Dipodomys,merriami,Rodent
6,9,7,16,1977,1,DM,F,34.0,NaN,Dipodomys,merriami,Rodent
7,7,7,16,1977,2,PE,F,NaN,NaN,Peromyscus,eremicus,Rodent

<img src = 'images/merged_inner.png'>

<font color = 'orange', size = 4>
what species ids were shared keys?
</font>

In [34]:
print('surveys ids =', surveys_sub.species_id.sort_values().unique())
print('species ids =', species_sub.species_id.sort_values().unique())
print('merged_inner ids =',merged_inner.species_id.sort_values().unique())

surveys ids = ['DM' 'NL' 'PE' 'PF']
species ids = ['DM' 'NL' 'PE']
merged_inner ids = ['DM' 'NL' 'PE']

<font color = 'orange', size = 4>
how can we see what record ids we lost?
</font>

<font color = 'orange', size = 4>
first let's list the record ids in the merged data
</font>

In [37]:
merged_ids = merged_inner.record_id.unique()
merged_ids

array([1, 2, 3, 4, 5, 8, 9, 7], dtype=int64)

<font color = 'orange', size = 4>
then we'll look at our surveys data that is not in that list of merged ids
</font>

In [41]:
surveys_sub[~surveys_sub.record_id.isin(merged_ids)]

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
5,6,7,16,1977,1,PF,M,14.0,NaN
9,10,7,16,1977,6,PF,F,20.0,NaN

<font color = 'blue', size = 6>
<b>
Left Joins
</b>
</font>

<font color = 'orange', size = 4>
let's say we wanted to keep all the records from our surveys data
</font>

<font color = 'orange', size = 4>
we can do this with a left join, assigning surveys to the left
</font>

<img src = 'images/venn_left.png'>

In [46]:
merged_left = pd.merge(left = surveys_sub, right = species_sub, 
                        left_on = 'species_id', right_on = 'species_id',
                        how = 'left')
merged_left.shape

(10, 12)

<font color = 'orange', size = 4>
you can see that there are nulls where species_id is PF
</font>

In [47]:
merged_left

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,genus,species,taxa
0,1,7,16,1977,2,NL,M,32.0,NaN,Neotoma,albigula,Rodent
1,2,7,16,1977,3,NL,M,33.0,NaN,Neotoma,albigula,Rodent
2,3,7,16,1977,2,DM,F,37.0,NaN,Dipodomys,merriami,Rodent
3,4,7,16,1977,7,DM,M,36.0,NaN,Dipodomys,merriami,Rodent
4,5,7,16,1977,3,DM,M,35.0,NaN,Dipodomys,merriami,Rodent
5,6,7,16,1977,1,PF,M,14.0,NaN,NaN,NaN,NaN
6,7,7,16,1977,2,PE,F,NaN,NaN,Peromyscus,eremicus,Rodent
7,8,7,16,1977,1,DM,M,37.0,NaN,Dipodomys,merriami,Rodent
8,9,7,16,1977,1,DM,F,34.0,NaN,Dipodomys,merriami,Rodent
9,10,7,16,1977,6,PF,F,20.0,NaN,NaN,NaN,NaN

<font color = 'blue', size = 6>
<b>
Other Join Types
</b>
</font>

<font color = 'orange', size = 4>
the other two join types are 'right' and 'outer'
</font>

<font color = 'orange', size = 4>
right is essentially the same thing as left
</font>

<img src = 'images/venn_right.png'>

<font color = 'orange', size = 4>
outer preserves all data from both tables, but can leave many null values
</font>

<img src = 'images/venn_outer.png'>